'''
可以让我们的代码重复的去执行
while循环：

    while 条件：
        代码

    过程：判断条件是否为真，如果真，执行代码，然后再次判断条件，如果为假......直到条件为假，循环结束。
'''

"""
 #===== 死循环，一直循环，不结束。========
while True:  
   print("喷死你")
"""
"""
 #====== 用程序去数数，从1~100======
i = 1
while i <= 100:
    print(i)
    i = i + 1
"""
"""
#======1~100总和相加======
i = 1
s = 0
while i <= 100:
#    print(i) # 从1~100数数
    s = s + i # 累加
    i = i + 1
print(s)
"""

"""
#====1-2+3-4+5-6....-100==== #1
i = 1
s = 0
o = 0
while i <= 100:
    s = s + i
    i = i + 2
while o  <= 100:
    s = s - o
    o = o + 2
print(s)
"""

i = 1
s = 0
while i <= 100:
    s = s + i
    i = i + 1
    s = s - i
    i = i + 1
print(s)

