"""
diyi = "第一篇作文"
dier = "第二篇作文"
"""
# 变量：可以发生改变的一个量。变量是用来区分不同数据的，可以指向一个内存空间,帮我们存贮一些数据。
"""
命名规范：
    1.必须是数字或者字母和下划线组合
    2.不能是数字开头，更不能是纯数字
    3.不能用Python关键字 eg：if print for while async Ture......
    4.不能用中文
    5.要有意义，别太长
    6.推荐使用下划线/驼峰命名 
        eg：下划线 name_of_teacher = "樵夫"  ***** 常用
            驼峰 Name0of0Teacher = "樵夫"   *****类的时候会用
            
            综上，看得舒服看得爽！！！！！
"""
'''
a = 188
print(a)
a = 166
print(a)
'''
name = "阿拉斯加"
print(name)  # 输出阿拉斯加
print("name")  # 输出 name

